Revit 2027 API
BuiltInFailures.LinkFailures.LinkedFileOpenInOtherDoc Property
 Linked file cannot be reloaded because it is loaded into another open document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LinkedFileOpenInOtherDoc { get; }
Public Shared ReadOnly Property LinkedFileOpenInOtherDoc As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LinkedFileOpenInOtherDoc {
	FailureDefinitionId^ get ();
}
static member LinkedFileOpenInOtherDoc : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace